In [1]:
import pandas as pd
import numpy as np

# VECTORS

In [2]:
a=pd.Series([1,2,3,4])
b=pd.Series([5,6,7,8])

In [3]:
print (a)

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
b

0    5
1    6
2    7
3    8
dtype: int64

In [5]:
a+b

0     6
1     8
2    10
3    12
dtype: int64

In [6]:
#index value (row number) can be changed . 
c=pd.Series([10,20,30,40,50] , index=[5,6,7,8,9])
c

5    10
6    20
7    30
8    40
9    50
dtype: int64

In [7]:
d=pd.Series([1,2,3,4,5,6,7] , index=[10,50,100,400,300,250,500])
d

10     1
50     2
100    3
400    4
300    5
250    6
500    7
dtype: int64

In [8]:
#Indexing 
#index number mentioned is used 
d[250]

6

In [9]:
#slicing
e=pd.Series([1,2,3,4,5,6,7])
e[0:3]

0    1
1    2
2    3
dtype: int64

In [10]:
# using Numpy value 
ab=np.array([11,22,33,44,55,66,77,88,99])
cd=pd.Series (ab)
cd+1

0     12
1     23
2     34
3     45
4     56
5     67
6     78
7     89
8    100
dtype: int32

In [11]:
#using dictionary values 
Dict={1:"amit",2:"ajit",3:"sanjeet"}
name=pd.Series(Dict)
name

1       amit
2       ajit
3    sanjeet
dtype: object

# DATAFRAME

In [12]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [13]:
#list of lists 
data=[["alex",1],["amit",2],["ajit",3]]
df=pd.DataFrame(data)
df

      0  1
0  alex  1
1  amit  2
2  ajit  3

In [14]:
# change the data type 
data=[["alex",1],["amit",2],["ajit",3]]
df=pd.DataFrame(data,dtype=float)
df

      0    1
0  alex  1.0
1  amit  2.0
2  ajit  3.0

In [15]:
data=[["square",4],["traiangle",3],['hexagon',6]]
df=pd.DataFrame(data,columns=["shape","Num of sides "])
df

       shape  Num of sides
0     square              4
1  traiangle              3
2    hexagon              6

In [16]:
#dictionary values
data={'name':["amit","ajit","sanjeet"],'age':[26,23,22]}
df=pd.DataFrame(data)
df

      name  age
0     amit   26
1     ajit   23
2  sanjeet   22

In [17]:
data=[{"a":1,"b":2},{"a":3,"b":4,"c":5}]
df=pd.DataFrame(data)
df

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [18]:
#renaming the row names (also called as index names)
data=[{"a":1,"b":2},{"a":3,"b":4,"c":5}]
df=pd.DataFrame(data , index=["first","second"])
df

        a  b    c
first   1  2  NaN
second  3  4  5.0

In [19]:
#filter

data=[{"a":10,"b":20},{"a":30,"b":40,"c":50}]

df1=pd.DataFrame(data , index=["first","second"],columns=["a","b",])
#df1 will display value for mentioned columns 

df2=pd.DataFrame(data , index=["first","second"],columns=["a","b1"])
#df2 will display values for the mentioned columns 
#col b1 is not there so it will be displayed but with NaN

df3=pd.DataFrame(data , index=["first","second"],columns=["a","b1","c"])
#col b1 is not there and c has no input in first

df4=pd.DataFrame(data , index=["first","second"],columns=["a","c"])
#filters  the table based on the mentioned columns 

print(df1)
print ("\n")
print(df2)
print ("\n")
print(df3)
print ("\n")
print(df4)

         a   b
first   10  20
second  30  40


         a  b1
first   10 NaN
second  30 NaN


         a  b1     c
first   10 NaN   NaN
second  30 NaN  50.0


         a     c
first   10   NaN
second  30  50.0

# loc & iloc

label based indexing & indexed label based indexing

In [20]:
data={"name":["shreya","amit","mridul"],"age":[26,25,20],"marks":[95,65,70],"place":["bbsr","sng","bhr"]}
df=pd.DataFrame(data)
df

     name  age  marks place
0  shreya   26     95  bbsr
1    amit   25     65   sng
2  mridul   20     70   bhr

In [21]:
df.loc[:,"name"]

#loc always needs the row coloumn name

0    shreya
1      amit
2    mridul
Name: name, dtype: object

In [22]:
df.loc[:,"place"]

0    bbsr
1     sng
2     bhr
Name: place, dtype: object

In [23]:
df.iloc[:,2]

#iloc takes the index number  (2 stands for marks here )

0    95
1    65
2    70
Name: marks, dtype: int64

In [24]:
df=pd.DataFrame(np.random.randn(8,5), columns=("a","b","c","d","e"))
df

          a         b         c         d         e
0 -1.085162 -0.054352  1.315813 -1.642936 -1.849781
1 -1.435170 -2.752975  0.230356 -0.318124 -1.002953
2 -1.659899 -0.994238  1.326300 -1.457580  2.203073
3  0.842603  0.773877  0.083231  0.071668 -1.256889
4 -1.929030 -1.217649  0.596123  1.476766 -1.086223
5 -0.436863 -0.901150  1.276190 -0.455080  1.234277
6  0.072621 -0.058155 -0.030551 -0.137390 -0.515725
7 -0.860817 -0.827039 -0.467908 -0.004407  0.845508

In [25]:
df.loc[2:5,"b"]

2   -0.994238
3    0.773877
4   -1.217649
5   -0.901150
Name: b, dtype: float64

In [26]:
df.loc[:5,"b"]

0   -0.054352
1   -2.752975
2   -0.994238
3    0.773877
4   -1.217649
5   -0.901150
Name: b, dtype: float64

In [27]:
df.iloc[3:5,4]

3   -1.256889
4   -1.086223
Name: e, dtype: float64

In [28]:
#iloc ith range slicing for both row and columns 
df.iloc[3:5,2:4]

          c         d
3  0.083231  0.071668
4  0.596123  1.476766

In [29]:
#iloc ith with negative indexing 
df.iloc[:,-2]

0   -1.642936
1   -0.318124
2   -1.457580
3    0.071668
4    1.476766
5   -0.455080
6   -0.137390
7   -0.004407
Name: d, dtype: float64

In [30]:
#loc with range slicing for both row and columns 
df.loc[3:5,"a":"c"]

          a         b         c
3  0.842603  0.773877  0.083231
4 -1.929030 -1.217649  0.596123
5 -0.436863 -0.901150  1.276190

In [31]:
from numpy import random

In [32]:
data=pd.DataFrame(random.randn(5,4),index=["MA","SC","PHY","Chem","Eng"] ,columns=["sem1","sem2","sem3","sem4"])
data

          sem1      sem2      sem3      sem4
MA    1.339210 -0.488084 -0.044991 -0.395205
SC    0.821560  1.132818 -0.220053  0.081672
PHY  -0.145125 -0.110289  0.104564  0.461646
Chem -0.185268 -0.138043 -1.676878 -0.205795
Eng  -0.794563  0.118711  0.413067  0.382332

In [33]:
data.iloc[1:,:2]

          sem1      sem2
SC    0.821560  1.132818
PHY  -0.145125 -0.110289
Chem -0.185268 -0.138043
Eng  -0.794563  0.118711

In [34]:
data.loc["Chem":,"sem1":"sem3"]

          sem1      sem2      sem3
Chem -0.185268 -0.138043 -1.676878
Eng  -0.794563  0.118711  0.413067

# LS 03082021

In [35]:

import pandas as pd 
pd5=([22,25,51,4,65,54,58,51,54],[21,25,51,4,65,54,58,51,54],
     [20,25,51,4,65,54,58,51,54],[19,25,51,4,65,54,58,51,54],[18,25,51,4,65,54,58,51,54])
pd5

([22, 25, 51, 4, 65, 54, 58, 51, 54],
 [21, 25, 51, 4, 65, 54, 58, 51, 54],
 [20, 25, 51, 4, 65, 54, 58, 51, 54],
 [19, 25, 51, 4, 65, 54, 58, 51, 54],
 [18, 25, 51, 4, 65, 54, 58, 51, 54])

In [36]:
for i in range (len (df5)):
    for x in range (len(df5[])):
                if x<=20 :
                    print(x)
                else:
                    print ("000")

SyntaxError: invalid syntax (<ipython-input-36-860036c86f14>, line 2)

In [ ]:
df5=pd.DataFrame (pd5)
df5

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
plt.bar(df5[0],df5[0])